open-vela/contest2026_135_yongwangzhiqian/board/bk7258_t5ai/chip/include/bk7258_partition_layout.h
/* Auto-generated by gen_bk7258_partitions.py. Do not edit. */
#ifndef __BK7258_PARTITION_LAYOUT_H
#define __BK7258_PARTITION_LAYOUT_H

#define BK7258_PARTITION_LAYOUT_ID "bk7258-v3119-ab-7f14d67587a17bf9"
#define BK7258_PARTITION_LAYOUT_SHA256 "7f14d67587a17bf9d586dd822645c33035ee11015b6c895312d8b09bf55524ed"
#define BK7258_PARTITION_LAYOUT_SHA256_BYTES {0x7f, 0x14, 0xd6, 0x75, 0x87, 0xa1, 0x7b, 0xf9, 0xd5, 0x86, 0xdd, 0x82, 0x26, 0x45, 0xc3, 0x30, 0x35, 0xee, 0x11, 0x01, 0x5b, 0x6c, 0x89, 0x53, 0x12, 0xd8, 0xb0, 0x9b, 0xf5, 0x55, 0x24, 0xed}
#define BK7258_FLASH_SIZE 0x00800000
#define BK7258_FLASH_ERASE_SIZE 0x00001000
#define BK7258_FLASH_CRC_DATA_SIZE 32
#define BK7258_FLASH_CRC_TOTAL_SIZE 34
#define BK7258_FLASH_XIP_BASE 0x02000000
#define BK7258_PARTITION_COUNT 16
#define BK7258_SDK_PARTITIONS_TABLE_SIZE 17
#define BK7258_SDK_PARTITION_VALID_MASK 0x0001ffdf

#define BK7258_PARTITION_PRIMARY_BOOTLOADER_SDK_ID 0
#define BK7258_ROLE_BOOT_SDK_ID 0
#define BK7258_PARTITION_PRIMARY_BOOTLOADER_EXECUTABLE 1
#define BK7258_PARTITION_PRIMARY_BOOTLOADER_READABLE 1
#define BK7258_PARTITION_PRIMARY_BOOTLOADER_WRITABLE 0
#define BK7258_PARTITION_PRIMARY_BOOTLOADER_OFFSET 0x00000000
#define BK7258_ROLE_BOOT_OFFSET 0x00000000
#define BK7258_PARTITION_PRIMARY_BOOTLOADER_SIZE 0x00011000
#define BK7258_ROLE_BOOT_SIZE 0x00011000
#define BK7258_PARTITION_PRIMARY_BOOTLOADER_END 0x00011000
#define BK7258_ROLE_BOOT_END 0x00011000
#define BK7258_ROLE_BOOT_LOGICAL_OFFSET 0x00000000
#define BK7258_ROLE_BOOT_LOGICAL_SIZE 0x00010000
#define BK7258_ROLE_BOOT_XIP_START 0x02000000
#define BK7258_ROLE_BOOT_XIP_END 0x02010000

#define BK7258_PARTITION_PRIMARY_CP_APP_SDK_ID 1
#define BK7258_ROLE_SLOT_A_CP_SDK_ID 1
#define BK7258_PARTITION_PRIMARY_CP_APP_EXECUTABLE 1
#define BK7258_PARTITION_PRIMARY_CP_APP_READABLE 1
#define BK7258_PARTITION_PRIMARY_CP_APP_WRITABLE 1
#define BK7258_PARTITION_PRIMARY_CP_APP_OFFSET 0x00011000
#define BK7258_ROLE_SLOT_A_CP_OFFSET 0x00011000
#define BK7258_PARTITION_PRIMARY_CP_APP_SIZE 0x00154000
#define BK7258_ROLE_SLOT_A_CP_SIZE 0x00154000
#define BK7258_PARTITION_PRIMARY_CP_APP_END 0x00165000
#define BK7258_ROLE_SLOT_A_CP_END 0x00165000
#define BK7258_ROLE_SLOT_A_CP_LOGICAL_OFFSET 0x00010000
#define BK7258_ROLE_SLOT_A_CP_LOGICAL_SIZE 0x00140000
#define BK7258_ROLE_SLOT_A_CP_XIP_START 0x02010000
#define BK7258_ROLE_SLOT_A_CP_XIP_END 0x02150000

#define BK7258_PARTITION_PRIMARY_AP_APP_SDK_ID 2
#define BK7258_ROLE_SLOT_A_AP_SDK_ID 2
#define BK7258_PARTITION_PRIMARY_AP_APP_EXECUTABLE 1
#define BK7258_PARTITION_PRIMARY_AP_APP_READABLE 1
#define BK7258_PARTITION_PRIMARY_AP_APP_WRITABLE 1
#define BK7258_PARTITION_PRIMARY_AP_APP_OFFSET 0x00165000
#define BK7258_ROLE_SLOT_A_AP_OFFSET 0x00165000
#define BK7258_PARTITION_PRIMARY_AP_APP_SIZE 0x00121000
#define BK7258_ROLE_SLOT_A_AP_SIZE 0x00121000
#define BK7258_PARTITION_PRIMARY_AP_APP_END 0x00286000
#define BK7258_ROLE_SLOT_A_AP_END 0x00286000
#define BK7258_ROLE_SLOT_A_AP_LOGICAL_OFFSET 0x00150000
#define BK7258_ROLE_SLOT_A_AP_LOGICAL_SIZE 0x00110000
#define BK7258_ROLE_SLOT_A_AP_XIP_START 0x02150000
#define BK7258_ROLE_SLOT_A_AP_XIP_END 0x02260000

#define BK7258_PARTITION_S_APP_SDK_ID 9
#define BK7258_ROLE_SLOT_B_PAIR_SDK_ID 9
#define BK7258_PARTITION_S_APP_EXECUTABLE 0
#define BK7258_PARTITION_S_APP_READABLE 1
#define BK7258_PARTITION_S_APP_WRITABLE 1
#define BK7258_PARTITION_S_APP_OFFSET 0x00286000
#define BK7258_ROLE_SLOT_B_PAIR_OFFSET 0x00286000
#define BK7258_PARTITION_S_APP_SIZE 0x00275000
#define BK7258_ROLE_SLOT_B_PAIR_SIZE 0x00275000
#define BK7258_PARTITION_S_APP_END 0x004fb000
#define BK7258_ROLE_SLOT_B_PAIR_END 0x004fb000

#define BK7258_PARTITION_OTA_FINA_EXECUTIVE_SDK_ID 10
#define BK7258_ROLE_OTA_METADATA_PRIMARY_SDK_ID 10
#define BK7258_PARTITION_OTA_FINA_EXECUTIVE_EXECUTABLE 0
#define BK7258_PARTITION_OTA_FINA_EXECUTIVE_READABLE 1
#define BK7258_PARTITION_OTA_FINA_EXECUTIVE_WRITABLE 1
#define BK7258_PARTITION_OTA_FINA_EXECUTIVE_OFFSET 0x004fb000
#define BK7258_ROLE_OTA_METADATA_PRIMARY_OFFSET 0x004fb000
#define BK7258_PARTITION_OTA_FINA_EXECUTIVE_SIZE 0x00001000
#define BK7258_ROLE_OTA_METADATA_PRIMARY_SIZE 0x00001000
#define BK7258_PARTITION_OTA_FINA_EXECUTIVE_END 0x004fc000
#define BK7258_ROLE_OTA_METADATA_PRIMARY_END 0x004fc000

#define BK7258_PARTITION_USR_CONFIG_SDK_ID 6
#define BK7258_ROLE_VENDOR_CONFIG_SDK_ID 6
#define BK7258_PARTITION_USR_CONFIG_EXECUTABLE 0
#define BK7258_PARTITION_USR_CONFIG_READABLE 1
#define BK7258_PARTITION_USR_CONFIG_WRITABLE 1
#define BK7258_PARTITION_USR_CONFIG_OFFSET 0x004fc000
#define BK7258_ROLE_VENDOR_CONFIG_OFFSET 0x004fc000
#define BK7258_PARTITION_USR_CONFIG_SIZE 0x0000e000
#define BK7258_ROLE_VENDOR_CONFIG_SIZE 0x0000e000
#define BK7258_PARTITION_USR_CONFIG_END 0x0050a000
#define BK7258_ROLE_VENDOR_CONFIG_END 0x0050a000

#define BK7258_PARTITION_OTA_FINA_MIRROR_SDK_ID 11
#define BK7258_ROLE_OTA_METADATA_MIRROR_SDK_ID 11
#define BK7258_PARTITION_OTA_FINA_MIRROR_EXECUTABLE 0
#define BK7258_PARTITION_OTA_FINA_MIRROR_READABLE 1
#define BK7258_PARTITION_OTA_FINA_MIRROR_WRITABLE 1
#define BK7258_PARTITION_OTA_FINA_MIRROR_OFFSET 0x0050a000
#define BK7258_ROLE_OTA_METADATA_MIRROR_OFFSET 0x0050a000
#define BK7258_PARTITION_OTA_FINA_MIRROR_SIZE 0x00001000
#define BK7258_ROLE_OTA_METADATA_MIRROR_SIZE 0x00001000
#define BK7258_PARTITION_OTA_FINA_MIRROR_END 0x0050b000
#define BK7258_ROLE_OTA_METADATA_MIRROR_END 0x0050b000

#define BK7258_PARTITION_OTA_MANIFEST_A_SDK_ID 12
#define BK7258_ROLE_OTA_MANIFEST_A_SDK_ID 12
#define BK7258_PARTITION_OTA_MANIFEST_A_EXECUTABLE 0
#define BK7258_PARTITION_OTA_MANIFEST_A_READABLE 1
#define BK7258_PARTITION_OTA_MANIFEST_A_WRITABLE 1
#define BK7258_PARTITION_OTA_MANIFEST_A_OFFSET 0x0050b000
#define BK7258_ROLE_OTA_MANIFEST_A_OFFSET 0x0050b000
#define BK7258_PARTITION_OTA_MANIFEST_A_SIZE 0x00001000
#define BK7258_ROLE_OTA_MANIFEST_A_SIZE 0x00001000
#define BK7258_PARTITION_OTA_MANIFEST_A_END 0x0050c000
#define BK7258_ROLE_OTA_MANIFEST_A_END 0x0050c000

#define BK7258_PARTITION_OTA_MANIFEST_B_SDK_ID 13
#define BK7258_ROLE_OTA_MANIFEST_B_SDK_ID 13
#define BK7258_PARTITION_OTA_MANIFEST_B_EXECUTABLE 0
#define BK7258_PARTITION_OTA_MANIFEST_B_READABLE 1
#define BK7258_PARTITION_OTA_MANIFEST_B_WRITABLE 1
#define BK7258_PARTITION_OTA_MANIFEST_B_OFFSET 0x0050c000
#define BK7258_ROLE_OTA_MANIFEST_B_OFFSET 0x0050c000
#define BK7258_PARTITION_OTA_MANIFEST_B_SIZE 0x00001000
#define BK7258_ROLE_OTA_MANIFEST_B_SIZE 0x00001000
#define BK7258_PARTITION_OTA_MANIFEST_B_END 0x0050d000
#define BK7258_ROLE_OTA_MANIFEST_B_END 0x0050d000

#define BK7258_PARTITION_OTA_AUTH_POLICY_SDK_ID 14
#define BK7258_ROLE_OTA_AUTH_POLICY_SDK_ID 14
#define BK7258_PARTITION_OTA_AUTH_POLICY_EXECUTABLE 0
#define BK7258_PARTITION_OTA_AUTH_POLICY_READABLE 1
#define BK7258_PARTITION_OTA_AUTH_POLICY_WRITABLE 0
#define BK7258_PARTITION_OTA_AUTH_POLICY_OFFSET 0x0050d000
#define BK7258_ROLE_OTA_AUTH_POLICY_OFFSET 0x0050d000
#define BK7258_PARTITION_OTA_AUTH_POLICY_SIZE 0x00001000
#define BK7258_ROLE_OTA_AUTH_POLICY_SIZE 0x00001000
#define BK7258_PARTITION_OTA_AUTH_POLICY_END 0x0050e000
#define BK7258_ROLE_OTA_AUTH_POLICY_END 0x0050e000

#define BK7258_PARTITION_BL2_SDK_ID 15
#define BK7258_ROLE_BL2_SDK_ID 15
#define BK7258_PARTITION_BL2_EXECUTABLE 1
#define BK7258_PARTITION_BL2_READABLE 1
#define BK7258_PARTITION_BL2_WRITABLE 0
#define BK7258_PARTITION_BL2_OFFSET 0x0051d000
#define BK7258_ROLE_BL2_OFFSET 0x0051d000
#define BK7258_PARTITION_BL2_SIZE 0x00022000
#define BK7258_ROLE_BL2_SIZE 0x00022000
#define BK7258_PARTITION_BL2_END 0x0053f000
#define BK7258_ROLE_BL2_END 0x0053f000
#define BK7258_ROLE_BL2_LOGICAL_OFFSET 0x004d0000
#define BK7258_ROLE_BL2_LOGICAL_SIZE 0x00020000
#define BK7258_ROLE_BL2_XIP_START 0x024d0000
#define BK7258_ROLE_BL2_XIP_END 0x024f0000

#define BK7258_PARTITION_LITTLEFS_SDK_ID 16
#define BK7258_ROLE_LITTLEFS_SDK_ID 16
#define BK7258_PARTITION_LITTLEFS_EXECUTABLE 0
#define BK7258_PARTITION_LITTLEFS_READABLE 1
#define BK7258_PARTITION_LITTLEFS_WRITABLE 1
#define BK7258_PARTITION_LITTLEFS_OFFSET 0x00600000
#define BK7258_ROLE_LITTLEFS_OFFSET 0x00600000
#define BK7258_PARTITION_LITTLEFS_SIZE 0x00100000
#define BK7258_ROLE_LITTLEFS_SIZE 0x00100000
#define BK7258_PARTITION_LITTLEFS_END 0x00700000
#define BK7258_ROLE_LITTLEFS_END 0x00700000

#define BK7258_PARTITION_EASYFLASH_SDK_ID 7
#define BK7258_ROLE_EASYFLASH_CP_SDK_ID 7
#define BK7258_PARTITION_EASYFLASH_EXECUTABLE 0
#define BK7258_PARTITION_EASYFLASH_READABLE 1
#define BK7258_PARTITION_EASYFLASH_WRITABLE 1
#define BK7258_PARTITION_EASYFLASH_OFFSET 0x007fa000
#define BK7258_ROLE_EASYFLASH_CP_OFFSET 0x007fa000
#define BK7258_PARTITION_EASYFLASH_SIZE 0x00002000
#define BK7258_ROLE_EASYFLASH_CP_SIZE 0x00002000
#define BK7258_PARTITION_EASYFLASH_END 0x007fc000
#define BK7258_ROLE_EASYFLASH_CP_END 0x007fc000

#define BK7258_PARTITION_EASYFLASH_AP_SDK_ID 8
#define BK7258_ROLE_EASYFLASH_AP_SDK_ID 8
#define BK7258_PARTITION_EASYFLASH_AP_EXECUTABLE 0
#define BK7258_PARTITION_EASYFLASH_AP_READABLE 1
#define BK7258_PARTITION_EASYFLASH_AP_WRITABLE 1
#define BK7258_PARTITION_EASYFLASH_AP_OFFSET 0x007fc000
#define BK7258_ROLE_EASYFLASH_AP_OFFSET 0x007fc000
#define BK7258_PARTITION_EASYFLASH_AP_SIZE 0x00002000
#define BK7258_ROLE_EASYFLASH_AP_SIZE 0x00002000
#define BK7258_PARTITION_EASYFLASH_AP_END 0x007fe000
#define BK7258_ROLE_EASYFLASH_AP_END 0x007fe000

#define BK7258_PARTITION_SYS_RF_SDK_ID 3
#define BK7258_ROLE_CALIBRATION_RF_SDK_ID 3
#define BK7258_PARTITION_SYS_RF_EXECUTABLE 0
#define BK7258_PARTITION_SYS_RF_READABLE 1
#define BK7258_PARTITION_SYS_RF_WRITABLE 1
#define BK7258_PARTITION_SYS_RF_OFFSET 0x007fe000
#define BK7258_ROLE_CALIBRATION_RF_OFFSET 0x007fe000
#define BK7258_PARTITION_SYS_RF_SIZE 0x00001000
#define BK7258_ROLE_CALIBRATION_RF_SIZE 0x00001000
#define BK7258_PARTITION_SYS_RF_END 0x007ff000
#define BK7258_ROLE_CALIBRATION_RF_END 0x007ff000

#define BK7258_PARTITION_SYS_NET_SDK_ID 4
#define BK7258_ROLE_CALIBRATION_NET_SDK_ID 4
#define BK7258_PARTITION_SYS_NET_EXECUTABLE 0
#define BK7258_PARTITION_SYS_NET_READABLE 1
#define BK7258_PARTITION_SYS_NET_WRITABLE 1
#define BK7258_PARTITION_SYS_NET_OFFSET 0x007ff000
#define BK7258_ROLE_CALIBRATION_NET_OFFSET 0x007ff000
#define BK7258_PARTITION_SYS_NET_SIZE 0x00001000
#define BK7258_ROLE_CALIBRATION_NET_SIZE 0x00001000
#define BK7258_PARTITION_SYS_NET_END 0x00800000
#define BK7258_ROLE_CALIBRATION_NET_END 0x00800000

#define BK7258_SDK_PARTITION_FOREACH(_) \
  _(0, "bootloader", 0x00000000, 0x00011000, 1, 1, 0) \
  _(1, "application", 0x00011000, 0x00154000, 1, 1, 1) \
  _(2, "application1", 0x00165000, 0x00121000, 1, 1, 1) \
  _(3, "sys_rf", 0x007fe000, 0x00001000, 0, 1, 1) \
  _(4, "sys_net", 0x007ff000, 0x00001000, 0, 1, 1) \
  _(6, "usr_config", 0x004fc000, 0x0000e000, 0, 1, 1) \
  _(7, "easyflash", 0x007fa000, 0x00002000, 0, 1, 1) \
  _(8, "easyflash_ap", 0x007fc000, 0x00002000, 0, 1, 1) \
  _(9, "s_app", 0x00286000, 0x00275000, 0, 1, 1) \
  _(10, "ota_fina_executive", 0x004fb000, 0x00001000, 0, 1, 1) \
  _(11, "ota_fina_mirror", 0x0050a000, 0x00001000, 0, 1, 1) \
  _(12, "ota_manifest_a", 0x0050b000, 0x00001000, 0, 1, 1) \
  _(13, "ota_manifest_b", 0x0050c000, 0x00001000, 0, 1, 1) \
  _(14, "ota_auth_policy", 0x0050d000, 0x00001000, 0, 1, 0) \
  _(15, "application2", 0x0051d000, 0x00022000, 1, 1, 0) \
  _(16, "littlefs", 0x00600000, 0x00100000, 0, 1, 1)

#endif /* __BK7258_PARTITION_LAYOUT_H */
